chtMultiregionFoam/snappyMultiRegionHeater/constant/leftSolid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/leftSolid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    minX
    {
        type            patch;
        nFaces          40;
        startFace       2508;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       2548;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       2600;
    }
    leftSolid_to_bottomAir
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          520;
        startFace       2652;
        sampleMode      nearestPatchFace;
        sampleRegion    bottomAir;
        samplePatch     bottomAir_to_leftSolid;
    }
    leftSolid_to_heater
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3172;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_leftSolid;
    }
    leftSolid_to_topAir
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          520;
        startFace       3212;
        sampleMode      nearestPatchFace;
        sampleRegion    topAir;
        samplePatch     topAir_to_leftSolid;
    }
)

// ************************************************************************* //
